// Задача 3. Даны натуральные числа a и b. 
// Рекурсивно описать функцию возведения числа a в степень b,
// используя только операцию инкрементирования (“++”).

Console.Write("Введите число a = ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите показатель степени b = ");
int b = Convert.ToInt32(Console.ReadLine());
